Repository: m1chalz/AI-First
Catalog: iosApp/iosApp/Resources/*.lproj/Localizable.strings
Languages: pl

# petDetails.loading.message
source: Loading pet details...
pl: Ładowanie szczegółów zwierzęcia...

# petDetails.error.title
source: Failed to load pet details
pl: Nie udało się załadować szczegółów zwierzęcia

# petDetails.error.loadingFailed
source: Failed to load pet details. Please try again.
pl: Nie udało się załadować szczegółów zwierzęcia. Spróbuj ponownie.

# petDetails.label.dateOfDisappearance
source: Date of Disappearance
pl: Data zaginięcia

# petDetails.label.contactOwner
source: Contact owner
pl: Skontaktuj się z właścicielem

# petDetails.label.animalName
source: Animal Name
pl: Imię zwierzęcia

# petDetails.label.microchipNumber
source: Microchip number
pl: Numer mikroczipu

# petDetails.label.animalSpecies
source: Animal Species
pl: Gatunek zwierzęcia

# petDetails.label.animalRace
source: Animal Race
pl: Rasa zwierzęcia

# petDetails.label.animalSex
source: Animal Sex
pl: Płeć zwierzęcia

# petDetails.label.animalAge
source: Animal Approx. Age
pl: Przybliżony wiek zwierzęcia

# petDetails.label.placeOfDisappearance
source: Lat / Long
pl: Szer. / Dł.

# petDetails.label.additionalDescription
source: Animal Additional Description
pl: Dodatkowy opis zwierzęcia

# petDetails.format.yearsOld
source: %d years
pl: %d lat

# petDetails.button.showOnMap
source: Show on the map
pl: Pokaż na mapie

# petDetails.button.removeReport
source: Remove Report
pl: Usuń zgłoszenie

# petDetails.photo.notAvailable
source: Image not available
pl: Zdjęcie niedostępne

# petDetails.reward.label
source: Reward
pl: Nagroda

# announcementStatus.active
source: MISSING
pl: ZAGINIONE

# announcementStatus.found
source: FOUND
pl: ZNALEZIONE

# announcementStatus.closed
source: CLOSED
pl: ZAMKNIĘTE

# animalSpecies.dog
source: Dog
pl: Pies

# animalSpecies.cat
source: Cat
pl: Kot

# animalSpecies.bird
source: Bird
pl: Ptak

# animalSpecies.rabbit
source: Rabbit
pl: Królik

# animalSpecies.other
source: Other
pl: Inne

# animalGender.male
source: Male
pl: Samiec

# animalGender.female
source: Female
pl: Samica

# animalGender.unknown
source: Unknown
pl: Nieznana

# reportMissingPet.chipNumber.title
source: Microchip number
pl: Numer mikroczipu

# reportMissingPet.photo.title
source: Pet Photo
pl: Zdjęcie zwierzęcia

# reportMissingPet.description.title
source: Animal description
pl: Opis zwierzęcia

# reportMissingPet.contactDetails.title
source: Contact Details
pl: Dane właściciela

# reportMissingPet.summary.title
source: Summary
pl: Podsumowanie

# reportMissingPet.button.continue
source: Continue
pl: Dalej

# reportMissingPet.button.submit
source: Submit
pl: Wyślij

# microchipNumber.title
source: Microchip number
pl: Numer mikroczipu

# microchipNumber.heading
source: Microchip number
pl: Numer mikroczipu

# microchipNumber.description
source: Microchip identification is the most efficient way to reunite with your pet. If your pet has been microchipped and you know the microchip number, please enter it here.
pl: Identyfikacja mikroczipem to najskuteczniejszy sposób na odnalezienie zwierzęcia. Jeśli Twój pupil ma wszczepiony mikroczip i znasz jego numer, wprowadź go tutaj.

# microchipNumber.fieldLabel
source: Microchip number (optional)
pl: Numer mikroczipu (opcjonalnie)

# microchipNumber.continueButton
source: Continue
pl: Dalej

# animalPhoto.title
source: Your pet's photo
pl: Zdjęcie Twojego pupila

# animalPhoto.helper.required
source: Please upload a photo of the missing animal.
pl: Prześlij zdjęcie zaginionego zwierzęcia.

# animalPhoto.helper.pickerCancelled
source: Select a photo to continue – you can browse again anytime.
pl: Wybierz zdjęcie, aby kontynuować – możesz przeglądać ponownie w każdej chwili.

# animalPhoto.helper.loading
source: Downloading from iCloud…
pl: Pobieranie z iCloud…

# animalPhoto.alert.missing.title
source: Photo required
pl: Wymagane zdjęcie

# animalPhoto.alert.missing.message
source: Attach a JPG, PNG, HEIC, GIF or WEBP file before continuing.
pl: Dołącz plik JPG, PNG, HEIC, GIF lub WEBP przed kontynuacją.

# animalPhoto.button.browse
source: Browse
pl: Przeglądaj

# animalPhoto.button.remove
source: Remove
pl: Usuń

# animalPhoto.button.continue
source: Continue
pl: Kontynuuj

# animalPhoto.banner.settings
source: Open Settings
pl: Otwórz ustawienia

# animalPhoto.banner.retry
source: Try again
pl: Spróbuj ponownie

# animalPhoto.toast.mandatory
source: Photo is mandatory
pl: Zdjęcie jest obowiązkowe

# animalPhoto.tile.title
source: Upload animal photo
pl: Dodaj zdjęcie zwierzęcia

# common.loading
source: Loading...
pl: Ładowanie...

# common.retry
source: Retry
pl: Ponów

# common.cancel
source: Cancel
pl: Anuluj

# common.done
source: Done
pl: Gotowe

# common.continue
source: Continue
pl: Dalej

# common.back
source: Back
pl: Wstecz

# animalDescription.heading
source: Your pet's details
pl: Szczegóły Twojego pupila

# animalDescription.subheading
source: Fill out the details about the missing animal.
pl: Wypełnij szczegóły dotyczące zaginionego zwierzęcia.

# animalDescription.dateLabel
source: Date of disappearance
pl: Data zaginięcia

# animalDescription.speciesLabel
source: Animal species
pl: Gatunek zwierzęcia

# animalDescription.raceLabel
source: Animal race (optional)
pl: Rasa zwierzęcia (opcjonalnie)

# animalDescription.genderLabel
source: Gender
pl: Płeć

# animalDescription.ageLabel
source: Animal age (optional)
pl: Wiek zwierzęcia (opcjonalnie)

# animalDescription.coordinatesLabel
source: Lat / Long
pl: Szer. / Dł. geogr.

# animalDescription.descriptionLabel
source: Animal additional description (optional)
pl: Dodatkowy opis zwierzęcia (opcjonalnie)

# animalDescription.speciesPlaceholder
source: Select an option
pl: Wybierz opcję

# animalDescription.racePlaceholder
source: e.g., Golden Retriever
pl: np. Golden Retriever

# animalDescription.agePlaceholder
source: e.g., 5
pl: np. 5

# animalDescription.latitudePlaceholder
source: e.g., 52.2297
pl: np. 52.2297

# animalDescription.longitudePlaceholder
source: e.g., 21.0122
pl: np. 21.0122

# animalDescription.descriptionPlaceholder
source: Describe distinguishing features...
pl: Opisz cechy charakterystyczne...

# animalDescription.requestGPSButton
source: Request GPS position
pl: Pobierz pozycję GPS

# animalDescription.continueButton
source: Continue
pl: Dalej

# animalDescription.datePicker.title
source: Select Date
pl: Wybierz datę

# animalDescription.datePicker.done
source: Done
pl: Gotowe

# animalDescription.gpsHelperText
source: Location captured successfully
pl: Lokalizacja pobrana pomyślnie

# animalDescription.error.missingDate
source: Please select a date
pl: Proszę wybrać datę

# animalDescription.error.missingSpecies
source: Please select a species
pl: Proszę wybrać gatunek

# animalDescription.error.missingRace
source: Please enter the breed or race
pl: Proszę wprowadzić rasę

# animalDescription.error.missingGender
source: Please select a gender
pl: Proszę wybrać płeć

# animalDescription.error.invalidAge
source: Age must be between 0 and 40
pl: Wiek musi być między 0 a 40

# animalDescription.error.invalidLatitude
source: Latitude must be between -90 and 90
pl: Szerokość geograficzna musi być między -90 a 90

# animalDescription.error.invalidLongitude
source: Longitude must be between -180 and 180
pl: Długość geograficzna musi być między -180 a 180

# animalDescription.error.invalidCoordinateFormat
source: Invalid coordinate format
pl: Nieprawidłowy format współrzędnych

# animalDescription.toast.validationErrors
source: Please correct the highlighted fields
pl: Proszę poprawić podświetlone pola

# owners_details.screen_title
source: Owner's details
pl: Dane właściciela

# owners_details.subtitle
source: Add your contact information and potential reward.
pl: Dodaj swoje dane kontaktowe i ewentualną nagrodę.

# owners_details.phone.label
source: Phone number
pl: Numer telefonu

# owners_details.phone.placeholder
source: Enter phone number
pl: Wpisz numer telefonu...

# owners_details.phone.error
source: Enter at least 7 digits
pl: Wpisz co najmniej 7 cyfr

# owners_details.email.placeholder
source: Enter email address
pl: Wpisz adres email

# owners_details.email.error
source: Enter a valid email address
pl: Wpisz poprawny adres email

# owners_details.reward.label
source: Reward (optional)
pl: Nagroda dla znalazcy (opcjonalnie)

# owners_details.reward.placeholder
source: Describe reward
pl: Opisz nagrodę...

# owners_details.continue.button
source: Continue
pl: Dalej

# owners_details.back.button
source: Back
pl: Wstecz

# owners_details.error.no_connection.title
source: No connection
pl: Brak połączenia

# owners_details.error.no_connection.message
source: Please check your network and try again.
pl: Sprawdź połączenie i spróbuj ponownie.

# owners_details.error.generic.title
source: Something went wrong
pl: Coś poszło nie tak

# owners_details.error.generic.message
source: Please try again later.
pl: Spróbuj ponownie później.

# owners_details.alert.try_again
source: Try Again
pl: Spróbuj ponownie

# owners_details.alert.cancel
source: Cancel
pl: Anuluj
